{
  "status": {
    "money":  0,
    "energy": 4
  },

  "questions": {

    "index" : {
      "text":  "This is a game based on the working conditions in the electronic supply chain. It’s a fictional story based on a factual <a href=\"http://www.chinalaborwatch.org/report/98\">report about HEG technologies by China Labour Watch</a> and <a href=\"http://www.bbc.com/news/business-30532463\">the BBC report on Pegatron</a> in China. \n Your decisions in the game will not only influence your story, but also your energy level and the money you have.",
      "image": "leaWave.png",
      "a1": {
        "text":   "Start",
        "money":  0,
        "energy": 0,
        "next":   "start1"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "start1" : {
      "text":  "Your name is Mei. In order to support your family you have decided to move to Huizhou in the Guangdong province- a city in southern China which has seen its population grow from a mere 300,000 in 1990 to over 1.8 million today supported by its well-known technology sector.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Your family purchased your bus tickets so you could go to work and send money back home.",
        "money":  0,
        "energy": 0,
        "next":   "start2"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "start2" : {
      "text":  "After you rent a room for 40$ you hear one of the factories is hiring workers aged 16 to 30. Since you meet these qualifications, you decide to apply. You just have to fill in a form and decide:",
      "image": "leaMask.png",
      "a1": {
        "text":   "not to wait for the call back, just go home",
        "money":  -40,
        "energy": 0,
        "next":   "goinghome"
      },
      "a2": {
        "text":   "wait for them to call back",
        "money":  -40,
        "energy": 0,
        "next":   "contract1"
      },
      "a3": {
        "text":   "to take initiative and talk to someone with some influence, who might guarantee you a job", 
        "money":  -40,
        "energy": 0,
        "next":   "alone"
      }
    },

    "goinghome" : {
      "text": "Ahhh its nice to be back home. But your parents are out of money after paying your bus fare.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You feel guilty and start looking for a job again.",
        "money":  0,
        "energy": 0,
        "next":   "start2"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "alone" : {
      "text": "AThere is none you know here. Whom should you ask?",
      "image": "leaMask.png",
      "a1": {
        "text":   "You better just wait for them to call you!",
        "money":  0,
        "energy": 0,
        "next":   "contract1"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "contract1" : {
      "text":  "You are called back and invited to have a training session. You are shown circuit boards that the factory produces for two big companies. The job seems very exhausting, especially because you are required to stand on your feet all day long. You decide:",
      "image": "leaWave.png",
      "a1": {
        "text":   "to start working there",
        "money":  0,
        "energy": 0,
        "next":   "test"
      },
      "a2": {
        "text":   "to look for a job somewhere else",
        "money":  0,
        "energy": 0,
        "next":   "start2"
      },
      "a3": {
      }
    },

   "test" : {
      "text":  "The introductory training lasts three days and concludes with a short exam.",
      "video": "<iframe width=\"700\" height=\"400\" src=\"https://www.youtube.com/embed/kSvT02q4h40?start=74&end=104&version=3&rel=0&autoplay=1\" frameborder=\"0\" allowfullscreen></iframe>",
      "a1": {
        "text":   "You pass.",
        "money":  0,
        "energy": 0,
        "next":   "contract2"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "contract2" : {
      "text":  "It's time to sign the employment contract. You and a dozen of your new possible colleagues meet with one of the plant managers. You barely have time to skim through the contract before being asked to sign  multiple pages. You decide:",
      "image": "leaMask.png",
      "a1": {
        "text":   "This is unacceptable. You don't sign it and go back home. ",
        "money":  0,
        "energy": 0,
        "next":   "goinghome2"
      },
      "a2": {
        "text":   "You don't really have any other option but to sign in order to support your family.",
        "money":  0,
        "energy": 0,
        "next":   "id"
      },
      "a3": {
      }
    },

    "goinghome2" : {
      "text": "whew, that was very scary. Good thing you got away. Now what are you going to do?",
      "image": "leaMask.png",
      "a1": {
      },
      "a2": {
      },
      "a3": {
      }
    },

    "id" : {
      "text":  "The manager asks you for your ID. You feel very uncomfortable handing it over to someone else, but they insist on it. You know they are probably not going to give it back to you until you resign. So you:",
      "image": "leaMask.png",
      "a1": {
        "text":   "give them your ID anyway. You really need the job.",
        "money":  0,
        "energy": 0,
        "next":   "dorms"
      },
      "a2": {
        "text":   "keep it and decide to leave as this makes you uncomfortable.",
        "money":  0,
        "energy": 0,
        "next":   "goinghome"
      },
      "a3": {
      }
    },

    "dorms" : {
      "text":  "Your colleague Jiayi shows you the way to your dormitory. She explains: there are different dormitories, but only one is close to the factory. Yours, unfortunately, is far away. You stay with 8 other people in one room. The rent is free, but you have to pay 4$ for facilities in advance.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You’ve had an exhausting day and go to bed.",
        "money":  -4,
        "energy": 0,
        "next":   "dorms-morning"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "dorms-morning" : {
      "text":  "On your first day you awake before the others and get dressed quietly.Some of them worked the night shift and just went to bed while others have not yet returned. You meet Jiayi outside your room and she tells you to take either the shuttle bus or the motorcycle taxi. They all try to take the bus, but it's up to you as long as you're on time. You decide:",
      "image": "leaMask.png",
      "a1": {
        "text":   "to take the bus with everyone else.",
        "money":  0,
        "energy": 0,
        "next":   "bus"
      },
      "a2": {
        "text":   "to take the taxi and see a bit more of Huizhou.",
        "money":  0,
        "energy": 0,
        "next":   "taxi"
      },
      "a3": {
      }
    },

    "bus" : {
      "text":  "The bus is crowded, but it's fine. You have the opportunity to chat with some of your coworkers and get to know them a bit...",
      "image": "leaMask.png",
      "a1": {
        "text":   "You arrive!",
        "money":  0,
        "energy": 0,
        "next":   "telefon"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "taxi" : {
      "text":  "",
      "video": "<iframe width=\"700\" height=\"400\" src=\"http:\/\/www.youtube.com/embed/vPR7RyTS8DY?autoplay=1&rel=0\" frameborder=\"0\" allowfullscreen><\/iframe>",
      "a1": {
        "text":   "You arrive!",
        "money":  0,
        "energy": 0,
        "next":   "telefon"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "telefon" : {
      "text":  "You arrive at the factory. Since your grandmother isn't feeling well you promised to call her today. \n But one of the security guards  sees your phone and takes it from you. You proceed to:",
      "image": "leaMask.png",
      "a1": {
        "text":   " ask him to give it back to you.",
        "money":  0,
        "energy": 0,
        "next":   "advicetelefon"
      },
      "a2": {
        "text":   "just let him go. It's your first day and you don't want to cause trouble.",
        "money":  0,
        "energy": 0,
        "next":   "givetelefon"
      },
      "a3": {
      }
    },

    "advicetelefon" : {
      "text":  "As the security guard walks away, Jiayi explains to you that phones in the factory are not allowed. ",
      "image": "leaMask.png",
      "a1": {
        "text":   "start working",
        "money":  0,
        "energy": 0,
        "next":   "firstday"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "givetelefon" : {
      "text":  "You hand him the telephone and he walks away.",
      "image": "leaMask.png",
      "a1": {
        "text":   "start working",
        "money":  0,
        "energy": 0,
        "next":   "firstday"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "firstday" : {
      "text":  "The factory is huge and there are a lot of people around you. Since you are in charge of the circuit boards you are only allowed to take a break every two hours for ten minutes. You can’t really talk with coworkers, you have to concentrate as to not make mistakes. After eight hours, your feet and back hurt. Other workers notify you that you are supposed to work at least two more hours  over time.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You feel so tired and go back to the dorms.",
        "money":  0,
        "energy": 0,
        "next":   "minus"
      },
      "a2": {
        "text":   "You fulfill the obligation to stay and work at least two hours more.",
        "money":  0,
        "energy": 0,
        "next":   "exhausted"
      },
      "a3": {
      }
    },

   "minus" : {
      "text":  "You leave early. Your coworkers are surprised and explain to you the attendance award: the average wage they earn is 448$, but this is including any awards you may earn such as the attendance award. Every time you leave early,  4.87$ is deducted from a possible 16.34$. If you leave early or come late three times, you forfeit the award entirely.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Worried, you go to bed.",
        "money":  -4.87,
        "energy": 0,
        "next":   "workbusy"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "minusbusy" : {
      "text":  "You leave early. Your coworkers are surprised and explain to you the attendance award: the average wage they earn is 448$, but this is including any awards you may earn such as the attendance award. Every time you leave early,  4.87$ is deducted from a possible 16.34$. If you leave early or come late three times, you forfeit the award entirely.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Worried, you go to bed.",
        "money":  -4.87,
        "energy": 0,
        "next":   "wage"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "exhausted" : {
      "text":  "Your body hurts, you are tired and you really need some rest. When you finally arrive at the dorms you collapse from exhaustion.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You finally arrive at the dorms and you just fall completly exhausted in your bed.",
        "money":  0,
        "energy": -1,
        "next":   "workbusy"
      },
      "a2": {
      },
      "a3": {
      }
    },

       "exhaustedbusy" : {
      "text":  "Your body hurts, you are tired and you really need some rest. When you finally arrive at the dorms you collapse from exhaustion.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You finally arrive at the dorms and you just fall completly exhausted in your bed.",
        "money":  0,
        "energy": -2,
        "next":   "wage"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "exhaustedquit" : {
      "text":  "",
      "image": "leaMask.png",
      "a1": {
        "text":   "Your body hurts, you are tired and you really need some rest. There is no way you could imagine working tomorrow again, so you decide to leave the factory.",
        "money":  0,
        "energy": 0,
        "next":   "quit"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "quit" : {
      "text":  "When you try to resign, they make it so hard for you. It is practically impossible. They refuse to give you your ID. After a lot of hassle you leave without getting paid and return to your family. You spent more of their money than you were able to earn.",
      "image": "arrivingBackAtHome.gif",
      "a1": {
      },
      "a2": {
      },
      "a3": {
      }
    },

   "workbusy" : {
      "text":  "The next day you are back to work. Jiayi tells you it is a busy day, it is delivery day and you have to perform accordingly. Your work is exhausting and after working ten hours you are asked to stay longer. ",
      "image": "leaMask.png",
      "a1": {
        "text":   "You decide to stay longer.",
        "money":  0,
        "energy": 0,
        "next":   "exhaustedbusy"
      },
      "a2": {
        "text":   "You go home with a bad feeling.",
        "money":  0,
        "energy": 0,
        "next":   "minusbusy"
      },
      "a3": {
      }
    },

   "wage" : {
      "text":  "After working almost a month, Jiayi tells you your wage will be paid on the 20th of the following month. Since you are still in your probation period, you earn $211 and the rest of the attendance award twenty days later.",
      "image": "leaMask.png",
      "a1": {
        "text":   "After the probation period your wage will be $228 when you will finally be able to send some money back home!",
        "money":  227.35,
        "energy": 0,
        "next":   "drinking"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "drinking" : {
      "text":  "As you slowly adjust to your working conditions, one thing is still hard to get used to: you are not allowed to drink while working. You have breaks, but are still often thirsty. If you want to go to the restroom, you need to get a pass.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Otherwise you are not allowed to use the restroom.",
        "money":  0,
        "energy": 0,
        "next":   "health"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "health" : {
      "text": "You talk with coworkers who use acid to make the circuit boards you are working on. It seems they were never trained for safety hazards or potential health risks. \n That makes you feel confused about whether or not you really understand what potential risks this job poses for your health.",
        "image": "leaMask.png",
      "a1": {
        "text":   "You decide to complain to your superior, since you do not want to take any risks concerning your health.",
        "money":  0,
        "energy": 0,
        "next":   "complainhealth"
      },
      "a2": {
        "text":   "You ignore your gut feeling and just continue your day.",
        "money":  0,
        "energy": 0,
        "next":   "studentsintro"
      },
      "a3": {
      }
      },

    "complainhealth" : {
      "text": "You raise your concerns to your supervisor and ask for better safety equipment. He tells you not to worry and to get back to work.",
        "image": "leaMask.png",
      "a1": {
        "text":   "You insist on having the matter looked into.",
        "money":  0,
        "energy": 0,
        "next":   "firedhealth"
      },
      "a2": {
        "text":   "You follow his orders and go back to work.",
        "money":  0,
        "energy": 0,
        "next":   "studentsintro"
      },
      "a3": {
      }
    },

    "firedhealth" : {
      "text": "The supervisor becomes angry and tells you to mind your own business. He fires you on the spot.",
        "image": "leaMask.png",
      "a1": {
      },
      "a2": {
      },
      "a3": {
      }
    },

   "studentsintro" : {
      "text":  "You get to know a group of students from three different provinces: Hubei, Hunan and Guizhou. You talk with Yong, one of the students you meet on the way back to the dorms after work. He studies at a technical school and signed a three month contract at a labor dispatch company. They were not trained before starting work, they don't get paid for over hours or subsidy for the night shift. Yong tells you they are freshmen and junior students at college.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You are astonished at how hard these young college students work.",
        "money":  0,
        "energy": 0,
        "next":   "childworker"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "childworker" : {
      "text": "Another issue that troubles you is that of the child workers. They work extremely hard too. They are also hired by a labor dispatch company and the management tries to make everyone believe that they are of legal age when clearly they are not.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You know it’s common to have children working even though it is illegal, but there is not much you can do about it.",
        "money":  0,
        "energy": 0,
        "next":   "studentsadvice"
      },
      "a2": {
      },
      "a3": {
      }
      },

   "studentsadvice" : {
      "text":  "After a month, Yong approaches you to ask for your advice. He says the work is too difficult for him and a lot of other students. He spoke with almost 50 students who said they couldn't tolerate the harsh conditions any longer. His supervisor already told him he would not allow students to leave no matter how many quit together. You tell him:",
      "image": "leaMask.png",
      "a1": {
        "text":   "to take care of himself and quit.",
        "money":  0,
        "energy": 0,
        "next":   "studentsunpaid"
      },
      "a2": {
        "text":   "to be responsible and keep the job- it's only two month left anyway.",
        "money":  0,
        "energy": 0,
        "next":   "studentsexhausted"
      },
      "a3": {
      }
    },

   "studentsunpaid" : {
      "text":  "Yong and the others decide to take your advice and quit the next day. The supervisor, however,  does not accept their resignations. As a result,  they don't get paid their wages or their way back home.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You give Yong and two other students money for the bus back home and heavy-hearted you say good bye to them.",
        "money":  -40,
        "energy": 0,
        "next":   "samsung"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "studentsexhausted" : {
      "text":  "Yong and the others stay at the factory. They are extremely exhausted in the evenings and you try to cover from them from time to time but still, it's just too hard for them. You feel how your energy shrinks by seeing them this way.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Tell them to take care of themselves and quit.",
        "money":  0,
        "energy": 0,
        "next":   "studentsunpaid"
      },
      "a2": {
        "text":   "It's none of your business. It's time to get back to work!",
        "money":  0,
        "energy": -1,
        "next":   "work1"
      },
      "a3": {
      }
    },

   "samsung" : {
      "text":  "You’ve worked at this factory for quite some time already. You often feel very tired but have not lost site of the goal of sending some money back home. \n Jiayi passes by at your dorm after work. You are happy to see her because you haven't seen her in days! You tell her about the students and the many other things since you have last seen her Finally you ask her why she has been away. She explains she is working for a different company now. She earns a little more but the conditions are worse. She isn’t allowed to have the 10 minutes break every 2 hours that you have. In fact, she has no breaks at all. She also works more over time. She asks you if you want to join her as there is an open position at her company. You decide:",
      "image": "leaMask.png",
      "a1": {
        "text":   "to go work with her.",
        "money":  0,
        "energy": 0,
        "next":   "work1"
      },
      "a2": {
        "text":   "to stay at your company. The extra money is not worth the grueling conditions.",
        "money":  0,
        "energy": 0,
        "next":   "work1"
      },
      "a3": {
      }
    },

   "work1" : {
      "text":  "The factory is huge and there are a lot of people around you. You are in charge of (???) of the circuit boards. You are allowed to take a break every two hours for ten minutes. You can’t really talk with your coworkers, you have to be really concentrated to not make mistakes. After eight hours, your feet hurt and your back, too. The other workers tell you, that you are supposed to work at least two hours more, over hours.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You feel tired so you just decide to go back to the dorms.",
        "money":  0,
        "energy": 0,
        "next":   "minus1"
      },
      "a2": {
        "text":   "You follow the obligation and stay and work (at least two hours) more.",
        "money":  0,
        "energy": 0,
        "next":   "exhausted1"
      },
      "a3": {
      }
    },

   "minus1" : {
      "text":  "You leave early. Your coworkers are surprised and explain to you the attendance award: the average wage they earn is 448$, but this is including any awards you may earn such as the attendance award. Every time you leave early,  4.87$ is deducted from a possible 16.34$. If you leave early or come late three times, you forfeit the award entirely.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Worried, you go to bed.",
        "money":  -4.87,
        "energy": 0,
        "next":   "work2"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "minus2" : {
      "text":  "You leave early. Your coworkers are surprised and explain to you the attendance award: the average wage they earn is 448$, but this is including any awards you may earn such as the attendance award. Every time you leave early,  4.87$ is deducted from a possible 16.34$. If you leave early or come late three times, you forfeit the award entirely.",
      "image": "leaMask.png",
      "a1": {
        "text":   "Worried, you go to bed.",
        "money":  -4.87,
        "energy": 0,
        "next":   "wagecircle"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "exhausted1" : {
      "text":  "Your body hurts, you are tired and you really need some rest.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You finally arrive at the dorms and you just fall completly exhausted in your bed.",
        "money":  0,
        "energy": -1,
        "next":   "work2"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "exhausted2" : {
      "text":  "Your body hurts, you are tired and you really need some rest.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You finally arrive at the dorms and you just fall completly exhausted in your bed.",
        "money":  0,
        "energy": -2,
        "next":   "wagecircle"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "work2" : {
      "text":  "The next day, you are back to work. Jiayi tells you, that it's one of those busy days and you need to produce a lot more today, because they are supposed to deliver today. (????) Your work is exhausting and you can't imagine that they would ask you for more over hours. But after you worked ten hours already, someone approaches you and asks you to stay even longer, because it's very busy today.",
      "image": "leaMask.png",
      "a1": {
        "text":   "You decide to stay longer.",
        "money":  0,
        "energy": 0,
        "next":   "exhausted2"
      },
      "a2": {
        "text":   "You go home with a bad feeling.",
        "money":  0,
        "energy": 0,
        "next":   "minus2"
      },
      "a3": {
      }
    },

   "wagecircle" : {
      "text":  "After working almost a month, you ask Jiayi when you will get your wage. She tells you, it will be paid on the 20th of the next month. Twenty days later, they pay you. Since you are still in your probation period, you earn $211 and the rest of the attendance award. After the probation period your wage will be $228.",
      "image": "leaWave.png",
      "a1": {
        "text":   "Now you are finally able to send some money back home!",
        "money":  227.35,
        "energy": 0,
        "next":   "work1"
      },
      "a2": {
      },
      "a3": {
      }
    }

  }
}
