{
  "status": {
    "money":  0,
    "energy": 3
  },

  "questions": {

    "index" : {
      "text":  "This is a website on the working conditions in the economic supply chain. It’s a fictional story based on the report about HEG technologies by china labour watch (http://www.chinalaborwatch.org/report/98). \n You will be able to choose in the most situations. Your decisions will not only influence your story, but also your energy level and the money you have.",
      "image": "layout-game.jpg",
      "a1": {
        "text":   "start",
        "money":  0,
        "energy": 0,
        "next":   "start"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "start" : {
      "text":  "Your name is Mei. You decided to move to Huizhou, which is a city in the Guangdong province, to support your family. There is nothing to do for you at home and they need the money. Guangdong is very famous for factories producing hardware. \n You heard, one of the factories is hiring at the moment, so you want to apply there. You learn, that only people between 16 and 30 are hired, but since you are in the right age, you just have to fill in a form to apply.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "don’t wait for the to call back, just go home",
        "money":  0,
        "energy": 0,
        "next":   "goinghome"
      },
      "a2": {
        "text":   "wait for them to call back",
        "money":  0,
        "energy": 0,
        "next":   "contract1"
      },
      "a3": {
        "text":   "take the initiative and try to talk to someone with some influence, who will guarantee you a job", 
        "money":  0,
        "energy": 0,
        "next":   "alone"
      }
    },

   "contract1" : {
      "text":  "You have a training session. You will be shown the circuit boards the factory produces for two big companies. The job looks very exhausting, especially because you need to stand on your feet all the time. \n The training is three days. On the third day, you have to write a test",
      "image": "imgName.jpg",
      "a1": {
        "text":   "Test accomplished!",
        "money":  0,
        "energy": 0,
        "next":   "test"
      },
      "a2": {
        "text":   "Test failed!",
        "money":  0,
        "energy": 0,
        "next":   false
      },
      "a3": {
      }
    },

   "test" : {
      "text":  "Congratulations, you passed!",
      "image": "imgName.jpg",
      "a1": {
        "text":   "start working there",
        "money":  0,
        "energy": 0,
        "next":   "contract2"
      },
      "a2": {
        "text":   "look for a job somewhere else",
        "money":  0,
        "energy": 0,
        "next":   "goinghome"
      },
      "a3": {
      }
    },

    "contract2" : {
      "text":  "you have to sign the contract. You are going with other new workers to one of the managers to sign. You don't really have time to read it but you are able to see that the contract period is limited to three years and the probation period to one month. \n If you want to resignate, you have to announce it one month in advance, otherwise they take one month' wage. \n There is no one to explain you the details of the contract, they just ask you to sign the first and the last page.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "This is unbearable. You don't sign it and go back home.",
        "money":  0,
        "energy": 0,
        "next":   "goinghome"
      },
      "a2": {
        "text":   "You don't really have any other option but signing it when you want to support your family. So you sign it.",
        "money":  0,
        "energy": 0,
        "next":   "dorms"
      },
      "a3": {
      }
    },

    "dorms" : {
      "text":  "One of the other workers, An, shows you the way to your dormitory. She explains: There are different dormitories, but only one of them (the female-only one) is close to the factory. The one you have to go to is far away. You stay with 8 other people in one room. The rents are free, but we have to pay the facilities. \n You pay in advance 4$.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "After this exhausting day you just go to bed.",
        "money":  -4,
        "energy": 0,
        "next":   "dorms-morning"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "dorms-morning" : {
      "text":  "You wake up in your room. The others are still sleeping, but because it’s your first day, you are still excited. You get up and get dressed, trying not to wake the others up. Some of them worked the night shift and just went to bed or are even not there yet. \n You meet An outside your room and she tells you, you can take either the shuttle bus or the motorcycle taxi. They all try to take the bus, but it's up to you, as long as you're in time. She shows you, where both get off and leaves you there, because she has appointment with one of her friends.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "Take the bus with everyone else.",
        "money":  0,
        "energy": 0,
        "next":   "bus"
      },
      "a2": {
        "text":   "Take the taxi and see a bit more of Huizhou.",
        "money":  0,
        "energy": 0,
        "next":   "taxi"
      },
      "a3": {
      }
    },
    "bus" : {
      "text":  "The bus is crowded, but it's fine. You have the opportunity to chat with some of your coworkers and get to know them a bit...",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You arrive!",
        "money":  0,
        "energy": 0,
        "next":   "telefon"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "taxi" : {
      "text":  "<iframe width=\"420\" height=\"315\" src=\"http:\/\/www.youtube.com/embed/vPR7RyTS8DY\" frameborder=\"0\" allowfullscreen><\/iframe>",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You arrive!",
        "money":  0,
        "energy": 0,
        "next":   "telefon"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "telefon" : {
      "text":  "You arrive at the factory. Your grandmother isn't feeling well so you promised to call her today. \n But soon after you entered the factory, one of the securities sees your phone and takes it from you.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You ask him to give it back to you.",
        "money":  0,
        "energy": 0,
        "next":   "advicetelefon"
      },
      "a2": {
        "text":   "You just let him go. It's your first day and you don't want to cause trouble.",
        "money":  0,
        "energy": 0,
        "next":   "givetelefon"
      },
      "a3": {
      }
    },

    "advicetelefon" : {
      "text":  "In the second you want to say something, there is someone grabbing your arm. One of the other workers tries to calm you. \n As the security worker walks away, An explains you that phones in the factory are not allowed and you have a nice short chat before you start working.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "start working",
        "money":  0,
        "energy": 0,
        "next":   "firstday"
      },
      "a2": {
      },
      "a3": {
      }
    },

    "givetelefon" : {
      "text":  "",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You just hand him the telephone and he walks away.",
        "money":  0,
        "energy": 0,
        "next":   "firstday"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "firstday" : {
      "text":  "The factory is huge and there are a lot of people around you. You are in charge of (???) of the circuit boards. You are allowed to take a break every two hours for ten minutes. You can’t really talk with your coworkers, you have to be really concentrated to not make mistakes. After eight hours, your feet hurt and your back, too. The other workers tell you, that you are supposed to work at least two hours more, over hours.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You feel tired so you just decide to go back to the dorms.",
        "money":  0,
        "energy": 0,
        "next":   "minus"
      },
      "a2": {
        "text":   "You follow the obligation and stay and work (at least two hours) more.",
        "money":  0,
        "energy": 0,
        "next":   "exhaused"
      },
      "a3": {
      }
    },

   "minus" : {
      "text":  "You leave earlier. People at the dorm seem to be surprised. They explain you, that you shouldn’t have left earlier. One of the reasons is the attendance award. The average wage, they earn is 448$, but this is including the awards you may earn. One of them is the attendance award. It’s 16.35 $, but every time you leave earlier,  4.87$ is deducted from it. If you leave earlier or come late three times, you can’t get the award at all.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "Worried, you go to bed.",
        "money":  -4.87,
        "energy": 0,
        "next":   "workbusy"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "minusbusy" : {
      "text":  "You leave earlier. People at the dorm seem to be surprised. They explain you, that you shouldn’t have left earlier. One of the reasons is the attendance award. The average wage, they earn is 448$, but this is including the awards you may earn. One of them is the attendance award. It’s 16.35 $, but every time you leave earlier,  4.87$ is deducted from it. If you leave earlier or come late three times, you can’t get the award at all.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "Worried, you go to bed.",
        "money":  -4.87,
        "energy": 0,
        "next":   "workbusy"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "exhausted" : {
      "text":  "Your body hurts, you are tired and you really need some rest.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You finally arrive at the dorms and you just fall completly exhaused in your bed.",
        "money":  0,
        "energy": -1,
        "next":   "wage"
      },
      "a2": {
      },
      "a3": {
      }
    },

       "exhaustedbusy" : {
      "text":  "Your body hurts, you are tired and you really need some rest.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You finally arrive at the dorms and you just fall completly exhaused in your bed.",
        "money":  0,
        "energy": -1,
        "next":   "wage"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "exhaustedquit" : {
      "text":  "",
      "image": "imgName.jpg",
      "a1": {
        "text":   "There is no way, you could work tomorrow again, so you decide to leave the factory.",
        "money":  0,
        "energy": 0,
        "next":   "quit"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "quit" : {
      "text":  "",
      "image": "imgName.jpg",
      "a1": {
        "text":   " When you try to resign, they make it so hard for you, it's practically impossible. So you just leave without getting paid for the time you worked there. You return to your family. You spent more of their money then you were able to earn.",
        "money":  0,
        "energy": 0,
        "next":   false
      },
      "a2": {
      },
      "a3": {
      }
    },

   "workbusy" : {
      "text":  "The next day, you are back to work. An tells you, that it's one of those busy days and you need to produce a lot more today, because they are supposed to deliver today. (????) Your work is exhausting and you can't imagine that they would ask you for more over hours. But after you worked ten hours already, someone approaches you and asks you to stay even longer, because it's very busy today.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "You decide to stay longer.",
        "money":  0,
        "energy": 0,
        "next":   "exhausedbusy"
      },
      "a2": {
        "text":   "You go home with a bad feeling.",
        "money":  0,
        "energy": 0,
        "next":   "minusbusy"
      },
      "a3": {
      }
    },

   "wage" : {
      "text":  "After working almost a month, you ask An when you will get your wage. She tells you, it will be paid on the 20th of the next month. Twenty days later, they pay you. Since you are still in your probation period, you earn $211 and the rest of the attendance award. After the probation period your wage will be $228.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "Now you are finally able to send some money back home!",
        "money":  227.35,
        "energy": 0,
        "next":   "drinking"
      },
      "a2": {
      },
      "a3": {
      }
    },

   "drinking" : {
      "text":  "Slowly, you start to know the rules of the factory by heart. But one of the things that's the most exhausting is to not be allowed to drink while working. You have breaks, but still you are often thirsty while working.",
      "image": "imgName.jpg",
      "a1": {
        "text":   "More text is needed",
        "money":  0,
        "energy": 0,
        "next":   "winner"
      },
      "a2": {
      },
      "a3": {
      }
    }
  }
}
